package com.news.news_app.service;

import org.springframework.stereotype.Service;

@Service
public class StoryService {

    public Object getStoryByLanguage(String language) {
        return switch (language) {

            case "te" -> "తెలుగు కథ " +
                    ": ఇది నిజాయితీ మరియు కష్టపడి పనిచేయడం గురించి ఒక చిన్న నైతిక కథ. " +
                    "ఈ కథ పిల్లలు మరియు పెద్దలకు ఉపయోగపడుతుంది.             " +
            "ఒక చిన్న గ్రామంలో రామయ్య అనే రైతు ఉండేవాడు. అతను చాలా పేదవాడు అయినప్పటికీ ఎంతో నిజాయితీగా జీవించేవాడు. తన దగ్గర ఉన్న కొద్దిపాటి భూమిలో కష్టపడి పని చేసి కుటుంబాన్ని పోషించేవాడు. రోజూ ఉదయం సూర్యుడు ఉదయించే ముందే లేచి పొలానికి వెళ్లి సాయంత్రం వరకు శ్రమించేవాడు.\n" +
                    "\n" +
                    "ఒక రోజు పొలంలో పని చేస్తున్నప్పుడు, మట్టిలో మెరిసే ఒక చిన్న సంచి అతనికి కనిపించింది. దాన్ని తెరిచి చూసిన రామయ్య ఆశ్చర్యపోయాడు. అందులో బంగారు నాణేలు ఉన్నాయి. అతని మనసులో ఒక్క క్షణం ఆలోచన వచ్చింది – “ఇవి నా దగ్గరే ఉంచుకుంటే నా కష్టాలు అన్నీ తీరిపోతాయి” అని.\n" +
                    "\n" +
                    "కానీ వెంటనే అతని మనసు ఒప్పుకోలేదు. “ఇవి ఎవరివో కావచ్చు. కష్టపడి సంపాదించని ధనం నాకు ఆనందం ఇవ్వదు” అని నిర్ణయించుకున్నాడు.\n" +
                    "\n" +
                    "ఆ గ్రామంలో ఒక వ్యాపారి బంగారం పోగొట్టుకున్నాడని తెలిసింది. రామయ్య అతన్ని కలిసి సంచి అప్పగించాడు. వ్యాపారి ఎంతో ఆనందపడి, రామయ్య నిజాయితీకి మెచ్చుకొని మంచి బహుమతి ఇచ్చాడు. అంతేకాక అతనికి పని అవకాశం కూడా కల్పించాడు.\n" +
                    "\n" +
                    "ఆ రోజు నుంచి రామయ్య జీవితం మారిపోయింది. అతను మరింత సంతోషంగా జీవించాడు. గ్రామంలో అందరూ అతన్ని గౌరవంగా చూడడం ప్రారంభించారు.\n" +
                    "\n" +
                    "\uD83E\uDE94 నీతి\n" +
                    "\n" +
                    "నిజాయితీ ఎప్పుడూ మంచి ఫలితాలనే ఇస్తుంది.";

            case "hi" -> "हिंदी कहानी " +
                    ": यह ईमानदारी और धैर्य पर आधारित एक प्रेरणादायक नैतिक कहानी है।";

            case "ta" -> "தமிழ் கதை " +
                    ": நேர்மை மற்றும் பொறுமையைப் பற்றி சொல்லும் ஒரு சிறிய நெறிக் கதை.";

            case "kn" -> "ಕನ್ನಡ ಕಥೆ " +
                    ": ಸತ್ಯ ಮತ್ತು ಪರಿಶ್ರಮದ ಮಹತ್ವವನ್ನು ವಿವರಿಸುವ ನೈತಿಕ ಕಥೆ.";

            default -> "English Story " +
                    ": A simple moral story about honesty and patience.";
        };
    }
}
